# Data Preparation
Notebook ini berisian beberapa best practice yang dilakukan ketika data preparation

# Map & List

In [1]:
nums = [0,1,2,3,4,5]
squares = [x ** 2 for x in nums]
print(squares)
print(list(map(lambda x : x ** (1/2), nums)))

[0, 1, 4, 9, 16, 25]
[0.0, 1.0, 1.4142135623730951, 1.7320508075688772, 2.0, 2.23606797749979]

In [48]:
list2=[["Anne","Tim",2017],["Jimmy","Sarah",2015],["Bella","Alain",2010],["Sam","Neveen", 2007]]
# Nomor 2 :
print('Nomor 2')
list_couple = [[row[0], row[1]] for row in list2]
print(list_couple)
# Nomor 3 :
print('Nomor 3')
list_tahun = [row[2] for row in list2]
print(list_tahun)

Nomor 2
[['Anne', 'Tim'], ['Jimmy', 'Sarah'], ['Bella', 'Alain'], ['Sam', 'Neveen']]
Nomor 3
[2017, 2015, 2010, 2007]

# NumPy

In [4]:
# untuk komputasi
import numpy as np

In [6]:
Data = [["Bob", 160], ["Charlie", 150], ["Brian", 140.5]]

In [7]:
height_array = np.array([row[1] for row in Data])
print(height_array ** (1/2))
print(height_array.tolist())

[12.64911064 12.24744871 11.85326959]
[160.0, 150.0, 140.5]

In [8]:
x = np.array([[1,2,3], [8,10,40]])
print(x.sum(axis=0)) #sum along the row
print(x.sum(axis=1)) #sum along the col

[ 9 12 43]
[ 6 58]

# Pandas

In [9]:
code = ['US', 'AUS', 'JPN', 'IN', 'RUS', 'MOR', 'EGY']
ctr = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr = [True, False, False, False, False, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

my_dict = {'ctrcode': code, 'country': ctr, 'drivers_right': dr, 'cars_per_cpc': cpc}

In [11]:
# create dataframe
import pandas as pd
cars = pd.DataFrame(my_dict)
cars.head(1)

   cars_per_cpc        country ctrcode  drivers_right
0           809  United States      US           True

In [12]:
cars.shape

(7, 4)

In [13]:
cars.describe()

       cars_per_cpc
count      7.000000
mean     351.571429
std      345.595552
min       18.000000
25%       57.500000
50%      200.000000
75%      659.500000
max      809.000000

In [14]:
#mereplace index, dan indexnya menjadi ctrcode
cars_id = cars.set_index("ctrcode")
cars_id
print(type(cars_id))

<class 'pandas.core.frame.DataFrame'>

In [15]:
#untuk megambil subset
print(cars_id[['country', 'drivers_right']])
print(type(cars_id[['country', 'drivers_right']]))

               country  drivers_right
ctrcode
US       United States           True
AUS          Australia          False
JPN              Japan          False
IN               India          False
RUS             Russia          False
MOR            Morocco           True
EGY              Egypt           True
<class 'pandas.core.frame.DataFrame'>

In [16]:
cars_id[0:3]

         cars_per_cpc        country  drivers_right
ctrcode
US                809  United States           True
AUS               731      Australia          False
JPN               588          Japan          False

In [18]:
# loc pake nama kolom
# konfigurasi [baris], [kolom]
print(cars_id.loc[['RUS', 'MOR'], ['country']])

         country
ctrcode
RUS       Russia
MOR      Morocco

In [19]:
print(cars_id.iloc[[1,3], [1]])

           country
ctrcode
AUS      Australia
IN           India

In [20]:
print(cars_id[(cars_id.drivers_right == True) & (cars_id.cars_per_cpc > 200)])

         cars_per_cpc        country  drivers_right
ctrcode
US                809  United States           True

In [21]:
print(cars_id.sort_values(by=['cars_per_cpc']))
print(cars_id.sort_values(by=['cars_per_cpc'], ascending=False))

         cars_per_cpc        country  drivers_right
ctrcode
IN                 18          India          False
EGY                45          Egypt           True
MOR                70        Morocco           True
RUS               200         Russia          False
JPN               588          Japan          False
AUS               731      Australia          False
US                809  United States           True
         cars_per_cpc        country  drivers_right
ctrcode
US                809  United States           True
AUS               731      Australia          False
JPN               588          Japan          False
RUS               200         Russia          False
MOR                70        Morocco           True
EGY                45          Egypt           True
IN                 18          India          False

In [22]:
cars_id.isna().sum()

cars_per_cpc     0
country          0
drivers_right    0
dtype: int64

In [23]:
cars_id.duplicated().any()
cars_id.drop_duplicates()

         cars_per_cpc        country  drivers_right
ctrcode
US                809  United States           True
AUS               731      Australia          False
JPN               588          Japan          False
IN                 18          India          False
RUS               200         Russia          False
MOR                70        Morocco           True
EGY                45          Egypt           True

# Pandas Advance

In [25]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanesa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [26]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT   Vanesa    124
4      FB     Carl    243
5      FB    Sarah    350

## Group By

In [28]:
# describe dan group by lalu transpose
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Handling Missing Value

In [29]:
df1 = pd.DataFrame({'A': [1,2,np.nan],
                   'B' : [5,np.nan,np.nan],
                   'C' : [1,2,3]})

In [30]:
df1.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [31]:
df1.dropna() #menghapus NA

     A    B  C
0  1.0  5.0  1

In [32]:
df1.dropna(axis=1) # drop kolom yang mengandung NA

   C
0  1
1  2
2  3

In [33]:
df1.dropna(thresh=2) # drop NA dengan paling banyak NA sebanyak 2 bari di drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [47]:
df1.loc[:, ['A']].fillna(value=df1['A'].mean()) #isi NA dengan mean

     A
0  1.0
1  2.0
2  1.5

In [36]:
df1.fillna(method = 'ffill') # mengisi NA dengan value sebelumnya (forward)

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [38]:
df1.fillna(method = 'bfill') # mengisi NA dengan value setelahnya (backward)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Concate DF

In [39]:
df2 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B' : ['B0', 'B1', 'B2', 'B3'],
                   'C' : ['C0', 'C1', 'C2', 'C3'],
                   'D' : ['D0', 'D1', 'D2', 'D3']},
                  index=[0,1,2,3]);

In [40]:
df3 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B' : ['B4', 'B5', 'B6', 'B7'],
                   'C' : ['C4', 'C5', 'C6', 'C7'],
                   'D' : ['D4', 'D5', 'D6', 'D7']},
                  index=[4,5,6,7]);

In [41]:
#concate baris
pd.concat([df3, df2])

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [42]:
# concate kolom
pd.concat([df3, df2], axis=1)

     A    B    C    D    A    B    C    D
0  NaN  NaN  NaN  NaN   A0   B0   C0   D0
1  NaN  NaN  NaN  NaN   A1   B1   C1   D1
2  NaN  NaN  NaN  NaN   A2   B2   C2   D2
3  NaN  NaN  NaN  NaN   A3   B3   C3   D3
4   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   A7   B7   C7   D7  NaN  NaN  NaN  NaN

## Merge

In [43]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3']});

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']});

right2 = pd.DataFrame({'key': ['K0', 'K1'],
                    'C': ['C0', 'C1'],
                    'D' : ['D0', 'D1']});

In [44]:
pd.merge(left,right2,how='outer',on='key')

    A   B key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K1   C1   D1
2  A2  B2  K2  NaN  NaN
3  A3  B3  K3  NaN  NaN

## Join

In [45]:
join1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B' : ['B0', 'B1', 'B2', 'B3']},
                  index=['K0','K1','K2','K3']);
join2 = pd.DataFrame({'C' : ['C0', 'C1', 'C2'],
                   'D' : ['D0', 'D1', 'D2']},
                 index=['K0','K1','K2']);

In [46]:
join1.join(join2, how='right')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2